tap 'alienator88/homebrew-cask'
tap 'heroku/brew'
tap 'homebrew/cask-fonts'

brew 'bat'
brew 'bottom'
brew 'fd'
brew 'fish'
brew 'fpp'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'heroku'
brew 'hyperfine'
brew 'mas'
brew 'neovim'
brew 'rbenv'
brew 'ripgrep'
brew 'sd'
brew 'starship'
brew 'tealdeer'
brew 'tmux'
brew 'wget'
brew 'zoxide'

# cask 'flux'
cask 'alt-tab'
cask 'bartender'
cask 'betterdisplay'
cask 'bettertouchtool'
cask 'cork'
cask 'daisydisk'
cask 'downie'
cask 'fliqlo'
cask 'font-victor-mono'
cask 'hyperkey'
cask 'iina'
cask 'knockknock'
cask 'lulu'
cask 'ngrok'
cask 'onyx'
cask 'orbstack'
cask 'paletro'
cask 'pearcleaner'
cask 'qbittorrent'
cask 'raycast'
cask 'shottr'
cask 'signal'
cask 'stats'
cask 'viber'
cask 'wezterm'

mas 'Be Focused Pro: Pomodoro Timer', id: 961_632_517
mas 'Bitwarden', id: 1_352_778_147
mas 'HazeOver', id: 430_798_174
mas 'Pure Paste', id: 1_611_378_436
mas 'Slack for Desktop', id: 803_453_959
mas 'TextSniper - OCR simplified', id: 1_528_890_965
mas 'Timery for Toggl', id: 1_425_368_544

## Development
# brew 'imagemagick@6'
# brew 'libyaml' # Required for Ruby 3.2.0
# brew 'mysql'
# brew 'node'
# brew 'openssl'
# brew 'pkg-config'
# brew 'postgresql@9.5'
# brew 'readline'
# brew 'shared-mime-info'
# brew 'sqlite'
# brew 'zstd'
# brew 'typos-cli'
# cask 'alt-tab'
# cask 'hookshot'
