tap 'alienator88/homebrew-cask'
tap 'heroku/brew'
tap 'homebrew/cask-fonts'

brew 'bat'
brew 'bottom'
brew 'fd'
brew 'fish'
brew 'fpp'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'heroku'
brew 'lazygit'
brew 'mas'
brew 'neovim'
brew 'node'
brew 'rbenv'
brew 'ripgrep'
brew 'ruby-build'
brew 'sd'
brew 'starship'
brew 'tealdeer'
brew 'tmux'
brew 'wget'
brew 'zellij'
brew 'zoxide'

cask 'alt-tab'
cask 'bartender'
cask 'betterdisplay'
cask 'bettertouchtool'
cask 'daisydisk'
cask 'downie'
cask 'font-victor-mono'
cask 'google-chrome'
cask 'hyperkey'
cask 'knockknock'
cask 'lulu'
cask 'onyx'
cask 'orbstack'
cask 'paletro'
cask 'pearcleaner'
cask 'permute'
cask 'rectangle-pro'
cask 'shottr'
cask 'signal'
cask 'stats'
cask 'wezterm'

mas 'AdGuard for Safari', id: 1_440_147_259
mas 'Be Focused Pro: Pomodoro Timer', id: 961_632_517
mas 'HazeOver', id: 430_798_174
mas 'Infuse • Video Player', id: 1_136_220_934
mas 'Slack for Desktop', id: 803_453_959
mas 'TextSniper - OCR simplified', id: 1_528_890_965
mas 'Timery for Toggl', id: 1_425_368_544
mas 'Velja', id: 1_607_635_845

# Development
brew 'imagemagick@6'
# See: https://gist.github.com/fernandoaleman/385aad12a18fe50cf5fd1e988e76fd63
brew 'mysql'
brew 'openssl'
brew 'zstd'
