tap 'heroku/brew'
tap 'homebrew/cask-fonts'

brew 'bat'
brew 'bottom'
brew 'cmake'
brew 'fd'
brew 'fish'
brew 'fpp'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'gitui'
brew 'heroku'
brew 'hyperfine'
brew 'mas'
brew 'neovim'
brew 'rbenv'
brew 'ripgrep'
brew 'sd'
brew 'starship'
brew 'tealdeer'
brew 'tmux'
brew 'wget'
brew 'zoxide'

cask 'alt-tab'
cask 'appcleaner'
cask 'bartender'
cask 'betterdisplay'
cask 'daisydisk'
cask 'flux'
cask 'font-victor-mono'
cask 'hookshot'
cask 'hyperkey'
cask 'iina'
cask 'keka'
cask 'knockknock'
cask 'lulu'
cask 'mullvadvpn'
cask 'onyx'
cask 'paletro'
cask 'qbittorrent'
cask 'raycast'
cask 'shottr'
cask 'slack'
cask 'spotify'
cask 'stats'
cask 'wezterm', args: { "no-quarantine": true }

mas 'Amphetamine', id: 937984704
mas 'Bitwarden', id: 1_352_778_147
mas 'FiveNotes', id: 1_231_597_027
mas 'HazeOver', id: 430_798_174
mas 'Irvue', id: 1_039_633_667
mas 'Klack', id: 6_446_206_067
mas 'NextDNS', id: 1_464_122_853
mas 'Pure Paste', id: 1_611_378_436
mas 'Speediness', id: 1_596_706_466
mas 'TextSniper - OCR simplified', id: 1_528_890_965
mas 'Toggl Track: Hours & Time Log', id: 1_291_898_086

## Development
# brew 'imagemagick@6'
# brew 'libyaml' # Required for Ruby 3.2.0
# brew 'mysql'
# brew 'node'
# brew 'openssl'
# brew 'pkg-config'
# brew 'postgresql@9.5'
# brew 'readline'
# brew 'shared-mime-info'
# brew 'sqlite'
# brew 'zstd'
# cask 'ngrok'
